import * as React from 'react';
import Box from '@mui/material/Box';
import Button from '@mui/material/Button';
import Typography from '@mui/material/Typography';
import Modal from '@mui/material/Modal';

const style = {
  position: 'absolute',
  top: '50%',
  left: '50%',
  transform: 'translate(-50%, -50%)',
  width: 400,
  bgcolor: 'background.paper',
  border: '2px solid #000',
  boxShadow: 24,
  p: 4,
};

export default function BasicModal() {
  return (
    <div className="  flex  w-full  flex-col justify-center gap-2 desktop:gap-4">
      <p className=" whitespace-break-spaces text-xs text-second-color tablet:text-2xl desktopSm:text-3xl ">
        {' '}
        مانیتورینگ آنلاین هزاران سیستم تشخیص حریق{' '}
      </p>
      <div className="whitespace-break-spaces font-peyda text-xs tablet:text-lg desktopSm:text-xl   ">
        در مواقع بروز حریق یکی از دغدغه های متداول سازمان آتش نشانی و مالکین
        ساختمان ها کوتاه کردن زمان اطلاع رسانی به جهت تسریع در امداد رسانی به
        جهت کاهش هرچه بیشتر خسارات مالی و جانی می باشد می باشد ، در عصر کنونی با
        وجود اجبار سازمان آتش نشانی مبنی بر الزام سازندگان واحد های مسکونی و
        تجاری به نصب سیستم های اعلان و اطفا حریق مشاهده می شود در بسیاری از
        مواقع دستگاه های نصب شده دچار خطا شده و از حالت آماده به کار خارج می
        شوند که ساکنین و مالک ساختمان معمولا از این رخداد بی اطلاع می باشند که
        در چنین شرایطی در صورت بروز حریق هیچ گونه اطلاع رسانی از طریق سیستم نصب
        شده انجام نخواهد شد که تبعات چنین حادثه ای می تواند جبران ناپذیر باشد و
        از سوی دیگر در بسیاری از موارد حتی با وجود عملکرد صحیح سامانه اعلام حریق
        ، به علت عدم اطلاع رسانی به موقع به سازمان آتش نشانی و در نتیجه تاخیر در
        امداد رسانی خسارات فراوانی از جمله مالی و انسانی به جامعه تحمیل می شود .
        اما، متخصصان شرکت دانش بنیان آداک نگارگران نیکا با طراحی و تولید دستگاه
        "فایر مانیتور" این مشکلات را تا حد بسیار زیادی مرتفع ساخته اند که با نصب
        شدن تجهیز مذکور به عنوان مکمل سامانه اعلان حریق امکان پایش لحظه ای را به
        سازمان آتش نشانی، مالک و شرکت تعمیر و نگهداری می دهد و در صورت بروز خطا
        در دستگاه و وقوع حریق در کوتاه ترین زمان ممکن اطلاع رسانی های لازم از
        طریق پیامک ، تماس تلفنی و هشدار در سامانه برخط با مشخص شدن نقطه دقیق
        حادثه انجام خواهد شد .
      </div>
    </div>
  );
}
